bench/profiles/baseline/native-async-cpu.wrk.txt
Running 5s test @ http://127.0.0.1:51738/api/users/123
  4 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   410.64us   53.40us   2.96ms   85.33%
    Req/Sec    37.74k     1.41k   40.41k    75.00%
  Latency Distribution
     50%  404.00us
     75%  429.00us
     90%  459.00us
     99%  572.00us
  766183 requests in 5.10s, 73.80MB read
Requests/sec: 150227.37
Transfer/sec:     14.47MB