bench/profiles/baseline/native-mars-time-5.wrk.txt
Running 5s test @ http://127.0.0.1:50588/api/users/123
  4 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   482.26us  136.04us   6.28ms   94.20%
    Req/Sec    33.04k     3.95k   38.17k    63.24%
  Latency Distribution
     50%  450.00us
     75%  492.00us
     90%  541.00us
     99%    1.13ms
  670522 requests in 5.10s, 64.59MB read
Requests/sec: 131473.64
Transfer/sec:     12.66MB